#include <iostream>
using namespace std;
int a, b, c, n, d;

int main()
{
	setlocale(LC_ALL, "ru");
	int p;
	cout << "Выберите пункт:\n" <<
		"1.Присваивание\n" <<
		"2.Сумма наиюольших чисел\n" <<
		"3.Плоскость\n" <<
		"4.Координатная четверть\n" <<
		"5.Строка-описание\n" <<
		"6.1--999\n"; cin >> p;
	switch (p)
	{
	case 1:
		cout << "Введите два числа \n"; cin >> a >> b;
		if (a==b)
		{
			cout << "Первоначальные значения чисел " << a << " и " << b << endl;
			a = 0;
			b = 0;
			cout << "Значения чисел одинаковые, а значит, после проверки на одинаковые значения они будут равны " << a << "," << b << endl;
		}
		else {
			if (a>b)
			{
				cout << "Первоначальные значения чисел " << a << " и " << b << endl;
				b = a;
				cout << "Значение числа А больше В, а значит после првоерки их значения будут " << a << "," << b << endl;
			}
			else {
				if (b>a)
				{
					cout << "Первоначальные значения чисел " << a << " è " << b << endl;
					a = b;
					cout << "Значение числа В больше А, а значит после првоерки их значения будут " << a << "," << b << endl;
				}
			}
		}
		break;

	case 2:
		cout << "Ââåäèòå òðè òð¸õçíà÷íûõ ÷èñëà ÷èñëà \n"; cin >> a >> b >> c;
		if ((a>=b) & (a>=c))
		{
			if (b >= c)
			{
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << a << "+" << b << "=" << a + b;
			}
			else {
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << a << "+" << c << "=" << a + c;
			}
		}
		if ((b >= a) & (b >= c))
		{
			if (a >= c)
			{
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << b << "+" << a << "=" << a + b;
			}
			else {
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << b << "+" << c << "=" << b + c;
			}
		}
		if ((c >= b) & (c >= a))
		{
			if (b >= a)
			{
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << c << "+" << b << "=" << c + b;
			}
			else {
				cout << "Ñóììà íàèáîëüøèõ äâóõ ÷èñåë " << c << "+" << a << "=" << a + c;
			}
		}
		break;
		
	case 3:
		cout << "Ââåäèòå êîîðäèíàòû òî÷åê: \n" <<
			"A="; cin >> a;
		cout << "B="; cin >> b;
		cout << "C="; cin >> c;
		if (abs(a-b)<abs(a-c))
		{
			cout << "Ê ò÷îêå À áëèæå âñåãî ðàñïîëîæåíà òî÷êà Â è íàõîäèòñÿ íà ðàññòîÿíèè îò íå¸ " << abs(a - b) << endl;
		}
		else {
			cout << "Ê ò÷îêå À áëèæå âñåãî ðàñïîëîæåíà òî÷êà C è íàõîäèòñÿ íà ðàññòîÿíèè îò íå¸ " << abs(a - c) << endl;
		}
		break;

	case 4:
		cout << "Ââåäèòå êîîðäèíàòû òî÷êè, íå ëåæàùåé íà îñÿõ ÎÕ è OY: \n"; cin >> a >> b;
		if (a > 0 & b > 0)
		{
			cout << "Òî÷êà ëåæèò â ïåðâîé êîîðäèíàòíîé ÷åòâåðòè.\n";
		}
		else {
			if (a < 0 & b < 0)
			{
				cout << "Òî÷êà ëåæèò â òðåòüåé êîîðäèíàòíîé ÷åòâåðòè.\n";
			}
			else {
				if (a > 0 & b < 0)
				{
					cout << "Òî÷êà ëåæèò â ÷åòâ¸ðòîé êîîðäèíàòíîé ÷åòâåðòè.\n";
				}
				else {
					if (a < 0 & b>0)
					{
						cout << "Òî÷êà ëåæèò âî âòîðîé êîîðäèíàòíîé ÷åòâåðòè.\n";
					}
				}
			}
		}
		break;

	case 5:
		cout << "Ââåäèòå ëþáîå ÷èñëî: "; cin >> a;
		if (a==0)
		{
			cout << "×èñëî ðàâíî íóëþ.\n";
		}
		else {
			if (a!= abs(a))
			{
				if (a % 2 == 0)
				{
					cout << "Ýòî ÷¸òíîå îòðèöàòåëüíîå ÷èñëî.\n";
				}
				else
				{
					cout << "Ýòî íå÷¸òíîå îòðèöàòåëüíîå ÷èñëî.\n";
				}
			}
			else
			{
				if (a % 2 == 0)
				{
					cout << "Ýòî ÷¸òíîå ïîëîæèòåëüíîå ÷èñëî.\n";
				}
				else
				{
					cout << "Ýòî íå÷¸òíîå ïîëîæèòåëüíîå ÷èñëî.\n";
				}
			}
		}
		break;

	case 6:
		cout << "Ââåäèòå ëþîå ÷èñëî îò 1 äî 999: "; cin >> a;
		if (a<100)
		{
			if (a % 2 == 0)
			{
				cout << "Ýòî ÷¸òíîå äâóçíà÷íîå ÷èñëî.\n";
			}
			else
			{
				cout << "Ýòî íå÷¸òíîå äâóçíà÷íîå ÷èñëî.\n";
			}
		}
		else
		{
			if (a % 2 == 0)
			{
				cout << "Ýòî ÷¸òíîå òð¸õçíà÷íîå ÷èñëî.\n";
			}
			else
			{
				cout << "Ýòî íå÷¸òíîå òð¸õçíà÷íîå ÷èñëî.\n";
			}
		}
	default:
		break;
	}
}
