#include <iostream>
using namespace std;
float const pi = 3.14;

int main()
{
	setlocale(0, "");
	int programma;
	double a, a1,a2, y, x;
	int b,b2,c1,c2;

	cout << "Выберите пункт " << "\n" <<
		"1. Перевод градусов в радианы." << "\n" <<
		"2. Перевод радиан в градусы." << "\n" <<
		"3. Конфеты." << "\n" <<
		"4. Расстояние мужду авто." << "\n" <<
		"5. Линейное уравнение." << "\n" <<
		"6. Система линейных уравнений." << "\n";
		cin >> programma;

		switch (programma)
		{
		case 1:
			cout << "Введите значение угла альфа в градусах: "; cin >> a;
			a1 = pi * a / 180;
			cout << "Угол " << a << " равен " << a1 << " радиан" << endl;
			break;
		
		case 2:
			cout << "Введите значение угла альфа в радианах: "; cin >> a1;
			a = 180*a1/pi;
			cout << "Угол " << a1 << " равен " << a << " градусов" << endl;
			break;

		case 3:
			x = 10;
			a = 100;
			cout << "Один килограмм этих конфет стоит " << a / x << " рублей" << endl;
			cout << "Введите нужное коллчиество килограмм конфет " << endl; cin >> y;
			cout << y << " килограмм конфет будет стоить " << a * y / x << " рублей" << endl;
			break;

		case 4:
			int v1, v2, s, t;
			cout << "Скорость первого автомобиля " << endl; cin >> v1;
			cout << "Скорость второго автомобиля " << endl; cin >> v2;
			cout << "Расстояние между автомобилями до начала измерений " << endl; cin >> s;
			cout << "Сколько прошло времени " << endl; cin >> t;
			if (t==1)
			{
				cout << "Расстояние между автомобилями через " << t << " час равно " << (v1 * t + v2 * t) + s << " км" << endl;
			}
			else
			{
				if (t > 1 & t < 5)
				{
					cout << "Расстояние между автомобилями через " << t << " часа равно " << (v1 * t + v2 * t) + s << " км" << endl;
				}
				else
				{
					cout << "Расстояние между автомобилями через " << t << " часов равно " << (v1 * t + v2 * t) + s << " км" << endl;
				}
			}
			
			break;

		case 5:
			cout << "Дано линейное уравнение вида A*x+B=0" << endl;
			cout << "Введите коэфициенты A и B \n" <<
				"A="; cin >> a;
			cout<<"B="; cin >> b;;
				x = -b / a;
				if (a==0)
				{
					cout << "По услвоию А ненулевое число; X может принимать любые значения" << endl;
				}
				else
				{
					cout << "Значение X равно " << x << endl;
				}
			break;

		case 6:
			cout << "Дана система линейных уравнений \n" <<
				"a1*x+b1*y=c1 \n" <<
				"a2*x+b2*y=c2 \n";
			cout << "Введите коэфициенты a,b и c к первому уравнению \n" <<
				"a1="; cin >> a;
			cout << "b1="; cin >> b;
			cout << "c1="; cin >> c1;
			cout << "Введите коэфициенты a,b и c ко второму уравнению \n" <<
				"a2="; cin >> a2;
			cout << "b2="; cin >> b2;
			cout << "c2="; cin >> c2;
			if ((a * b2 - a2 * b)==0)
			{
				cout << "Решений нет" << endl;
			}
			else
			{
				x = (c1 * b2 - c2 * b) / (a * b2 - a2 * b);
				y = (c2 * a - a2 * c1) / (a * b2 - a2 * b);
				cout << "Значение x " << x << " Значение y " << y << endl;
			}
			break;

		default:
			cout << "Такого пункта нема" << endl;
			break;
		}
}