#include <iostream>
using namespace std;
float const pi = 3.14;

int main()
{
	setlocale(0, "");
	int programma;
	double a, a1,a2, y, x;
	int b,b2,c1=2,c2=5;

	cout << "Выберите пункт " << "\n" <<
		"1. Перевод градусов в радианы." << "\n" <<
		"2. Перевод радиан в градусы." << "\n" <<
		"3. Конфеты." << "\n" <<
		"4. Расстояние мужду авто." << "\n" <<
		"5. Линейное уравнение." << "\n" <<
		"6. Система линейных уравнений." << "\n";
		cin >> programma;

		switch (programma)
		{
		case 1:
			cout << "Введите значение угла альфа в градусах: "; cin >> a;
			a1 = pi * a / 180;
			cout << "Угол " << a << " равен " << a1 << " радиан" << endl;
			break;
		
		case 2:
			cout << "Введите значение угла альфа в радианах: "; cin >> a1;
			a = 180*a1/pi;
			cout << "Угол " << a1 << " равен " << a << " градусов" << endl;
			break;

		case 3:
			x = 10;
			a = 100;
			cout << "Один килограмм этих конфет стоит " << a / x << " рублей" << endl;
			cout << "Введите нужное коллчиество килограмм конфет " << endl; cin >> y;
			cout << y << " килограмм конфет будет стоить " << a * y / x << " рублей" << endl;
			break;

		case 4:
			int v1, v2, s, t;
			s = 5;
			cout << "Скорость первого автомобиля " << endl; cin >> v1;
			cout << "Скорость второго автомобиля " << endl; cin >> v2;
			cout << "Расстояние между автомобилями до начала измерений " << s <<" км"<< endl;
			cout << "Сколько прошло времени " << endl; cin >> t;
			cout << "Расстояние между автомобилями через " << t << " часов равно " << (v1 * t + v2 * t) + s << " км" << endl;
			break;

		case 5:
			cout << "Дано линейное уравнение вида a*x+b=0" << endl;
			cout << "Введите коэфициенты a и b \n" <<
				"a="; cin >> a;
			cout<<"b="; cin >> b;;
				x = -b / a;
				cout << "Значение X равно " << x << endl;
			break;

		case 6:
			cout << "Дана система линейных уравнений \n" <<
				"a1*x+b1*y=c1 \n" <<
				"a2*x+b2*y=c2 \n";
			cout << "Введите коэфициенты a и b к первому уравнению \n" <<
				"a="; cin >> a;
			cout << "b="; cin >> b;
			cout << "Введите коэфициенты a и b ко второму уравнению \n" <<
				"a="; cin >> a2;
			cout << "b="; cin >> b2;
			x = (2 * b2 - 5 * b) / (a * b2 - b * a2);
			y = (a * 5 - 2 * a2) / (a * b2 - b * a2);
			cout << "Значение x " << x << " Значение y " << y << endl;
			break;

		default:
			cout << "Такого пункта нема" << endl;
			break;
		}
}