#include <iostream>
using namespace std;
float const pi = 3.14;

int main()
{
	setlocale(0, "");
	int programma;
	double a, a1, a2, y, x;
	int b, b2, c1, c2;

	cout << "Выберите пункт " << "\n" <<
		"1. Градусы в радианы." << "\n" <<
		"2. Радианы в градусы." << "\n" <<
		"3. Конфеты." << "\n" <<
		"4. Два втомобиля." << "\n" <<
		"5. Линейное уравнение." << "\n" <<
		"6. Система уравнений." << "\n";
	cin >> programma;

	switch (programma)
	{
	case 1:
		cout << "Введите угол альфа в градусах: "; cin >> a;
		a1 = pi * a / 180;
		cout << "Угол " << a << " в градусах равен " << a1 << " радиан" << endl;
		break;

	case 2:
		cout << "Введите угол альфа в радианах: "; cin >> a1;
		a = 180 * a1 / pi;
		cout << "Угол " << a1 << " в радианах равен " << a << " градусов" << endl;
		break;

	case 3:
		cout << "Дано \n";
		cout << "Известное количесвто кг " << endl; cin >> x;
		cout << "Стоимость этого килограмма " << endl; cin >> a;
		cout << "Один кило конйет стоит " << a / x << " рублей" << endl;
		cout << "Введите нужное количество килограммов " << endl; cin >> y;
		cout << y << " кило конфет будет стоить " << a * y / x << " рублей" << endl;
		break;

	case 4:
		int v1, v2, s, t;
		cout << "Введите скорость первого автомобиля " << endl; cin >> v1;
		cout << "Введите скорость второго автомобиля " << endl; cin >> v2;
		cout << "Изначальное расстояние между ними " << endl; cin >> s;
		cout << "Сколько прошло времени " << endl; cin >> t;
		if (t == 1)
		{
			cout << "После того как прошёл " << t << " час, расстояние между автомобилями стало " << (v1 * t + v2 * t) + s << " км" << endl;
		}
		else
		{
			if (t > 1 & t < 5)
			{
				cout << "После того как прошло " << t << " часа, расстояние между автомобилями стало " << (v1 * t + v2 * t) + s << " км" << endl;
			}
			else
			{
				cout << "После того как прошло " << t << " часов, расстояние между автомобилями стало " << (v1 * t + v2 * t) + s << " км" << endl;
			}
		}

		break;

	case 5:
		cout << "Дано уравнение вида A·x + B = 0" << endl;
		cout << "Введите значения A и B \n" <<
			"A="; cin >> a;
		cout << "B="; cin >> b;;
		x = -b / a;
		if (a == 0)
		{
			cout << "По условию А не должно быть равно 0" << endl;
		}
		else
		{
			cout << "Переменная X равна " << x << endl;
		}
		break;

	case 6:
		cout << "Дана система уравнений \n" <<
			"A1·x + B1·y = C1 \n" <<
			"A2·x + B2·y = C2 \n";
		cout << "Введите значения A,B и C для первого уравнения \n" <<
			"a1="; cin >> a;
		cout << "b1="; cin >> b;
		cout << "c1="; cin >> c1;
		cout << "Введите значения A,B и C для второго уравнения \n" <<
			"a2="; cin >> a2;
		cout << "b2="; cin >> b2;
		cout << "c2="; cin >> c2;
		if ((a * b2 - a2 * b) == 0)
		{
			cout << "Решение любые числа" << endl;
		}
		else
		{
			x = (c1 * b2 - c2 * b) / (a * b2 - a2 * b);
			y = (c2 * a - a2 * c1) / (a * b2 - a2 * b);
			cout << "Переменная x равна " << x <<"\n"<<"Переменная y равна " << y << endl;
		}
		break;

	default:
		cout << "Òàêîãî ïóíêòà íåìà" << endl;
		break;
	}
}
