#include<iostream>
using namespace std;
int x1, x2, y, y2, x3, y3, a, b;
double d, d1, d2, D, P, S;
int xA = 2, yA = -5, xB = -4, yB = -3, xC = -1, yC = -4;



int main()
{
	int p;
	setlocale(LC_ALL,"rus");

	cout << "\33[1;31m Выберите пункт \033[0m\n" <<
		"\33[1;32m 1. Расстояние между двумя точками \033[0m\n" <<
		"\33[1;33m 2. Расстояние между двумя точками \033[0m\n" <<
		"\33[1;34m 3. Расстояние между двумя точками \033[0m\n" <<
		"\33[1;35m 4. Расстояние между двумя точками \033[0m\n" <<
		"\33[1;36m 5. Расстояние между двумя точками \033[0m\n";
	cin >> p;

	switch (p)
	{
	case 1:
		cout << "\33[1;37m Введите координаты первой точки \033[0m\n";
		cin >> x1 >> y;
		cout << "Введите координаты второй точки \n";
		cin >> x2 >> y2;
		d = sqrt(pow(x1 - x2, 2) + pow(y - y2, 2));
		cout << "Расстояние между точками равно " << d;
		break;

	case 2:
		cout << "Введите координаты точки A:\n";
		cin >> x1 >> y;
		cout << "Введите координаты точки B:\n";
		cin >> x2 >> y2;
		cout << "Введите координаты точки C:\n";
		cin >> x3 >> y3;
		d1 = sqrt(pow(x1 - x3, 2) + pow(y - y3, 2));
		d2 = sqrt(pow(x2 - x3, 2) + pow(y2 - y3, 2));
		D = d2 + d1;
		cout << "Расстояние между тчоками A и C равно " << d1 << "\n";
		cout << "Расстояние между тчоками B и C равно " << d2 << "\n";
		cout << "Сумма длин отрезков AC и BC равно " << D << "\n";
		break;

	case 3:
		cout << "Расстояние между точками A и C равно " << sqrt(pow(xA - xC, 2) + pow(yA - yC, 2)) << "\n";
		cout << "Расстояние между точками B и C равно " << sqrt(pow(xB - xC, 2) + pow(yB - yC, 2)) << "\n";
		cout << "Их произведение равно " << sqrt(pow(xA - xC, 2) + pow(yA - yC, 2)) * sqrt(pow(xB - xC, 2) + pow(yB - yC, 2)) << "\n";
		break;

	case 4:
		cout << "Введите координаты точки 1 :\n";
		cin >> x1 >> y;
		cout << "Введите координаты точки 2 :\n";
		cin >> x2 >> y2;
		cout << "Длина прямоугольнка равна " << abs(x2 - x1) << "\n";
		cout << "Ширина прямоугольника равна " << abs(y - y2) << "\n";
		cout << "Периметр прямоугольника равен " << 2 * (abs(x2 - x1) + abs(y - y2)) << "\n";
		cout << "Площадь прямоугольника равна " << abs(x2 - x1) * abs(y - y2) << "\n";
		break;

	case 5:
		cout << "Введите координаты точки A:\n";
		cin >> x1 >> y;
		cout << "Введите координаты точки B :\n";
		cin >> x2 >> y2;
		cout << "Введите координаты точки C :\n";
		cin >> x3 >> y3;
		P = sqrt(pow(x1 - x2, 2) + pow(y - y2, 2)) + sqrt(pow(x2 - x3, 2) + pow(y2 - y3, 2)) + sqrt(pow(x3 - x1, 2) + pow(y3 - y, 2));
		S = sqrt(P / 2 * (P - sqrt(pow(x1 - x2, 2) + pow(y - y2, 2)) * (P / 2 - sqrt(pow(x2 - x3, 2) + pow(y2 - y3, 2)) * (P / 2 - sqrt(pow(x3 - x1, 2) + pow(y3 - y, 2))));
		cout << "Периметр треугольника равен " << P << "\n";
		cout << "Площадь треугольника равна " << S << "\n";
		break;
	default:

			break;
	}

}